const taskStega = [
  {id: 1, type: "Вопрос", text: "Что такое CTF?"},
  {id: 2, type: "Вопрос", text: "Что такое Стеганография?"},
  {id: 3, type: "Вопрос", text: "Какие есть виды Стеганографии?"},
  {id: 4, type: "Задание", text: "Подойдите к организатору за заданием по Стеганографии"}
];

const taskCrypto = [
  {id: 1, type: "Вопрос", text: "Что такое CTF?"},
  {id: 2, type: "Вопрос", text: "Что такое Криптография?"},
  {id: 3, type: "Вопрос", text: "Какие есть текстовые шифры?"},
  {id: 4, type: "Задание", text: "Подойдите к организатору за заданием по Криптографии"}
];

const taskOsint = [
  {id: 1, type: "Вопрос", text: "Что такое CTF?"},
  {id: 2, type: "Вопрос", text: "Что такое OSINT?"},
  {id: 3, type: "Вопрос", text: "Как называется игра, которая предлагает игрокам угадывать местоположение на карте мира на основе случайно выбранных изображений?"},
  {id: 4, type: "Задание", text: "Подойдите к организатору за заданием по OSINT"}
];

const taskPPC = [
  {id: 1, type: "Вопрос", text: "Что такое CTF?"},
  {id: 2, type: "Вопрос", text: "Что такое PPC в CTF?"},
  {id: 3, type: "Вопрос", text: "Какие языки активно применяются в PPC?"},
  {id: 4, type: "Задание", text: "Подойдите к организатору за заданием по PPC"}
];

const taskForensics = [
  {id: 1, type: "Вопрос", text: "Что такое CTF?"},
  {id: 2, type: "Вопрос", text: "Что такое Форензика?"},
  {id: 3, type: "Вопрос", text: "Что такое логи?"},
  {id: 4, type: "Задание", text: "Подойдите к организатору за заданием по Форензике"},
];

module.exports = { taskStega, taskCrypto, taskOsint, taskPPC, taskForensics };